Revit 2027 API
BuiltInFailures.SketchFailures.FloorDirectionNotSpecified Property
 Structural floor span direction not specified.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId FloorDirectionNotSpecified { get; }
Public Shared ReadOnly Property FloorDirectionNotSpecified As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ FloorDirectionNotSpecified {
	FailureDefinitionId^ get ();
}
static member FloorDirectionNotSpecified : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.SketchFailures Class
Autodesk.Revit.DB Namespace